app/controllers/units_controller.rb

 def index
   @runner = Runner.find(params[:runner_id])
---
SELECT * FROM "runners" WHERE ("runners"."id" = 5)

 def show
  @runner = Runner.find(params[:runner_id])
  @unit = @runner.units.find(params[:id])
---
SELECT * FROM "runners" WHERE ("runners"."id" = 5)
SELECT * FROM "units" WHERE ("units"."id" = 1 AND ("units".runner_id = 5))

 def new
  @runner = Runner.find(params[:runner_id])
---
SELECT * FROM "runners" WHERE ("runners"."id" = 5)

 def create
  @runner = Runner.find(params[:runner_id])
  @unit = @runner.units.build(params[:unit])
  if @unit.save
---
SELECT * FROM "runners" WHERE ("runners"."id" = 5)
INSERT INTO "units" ("created_at", "runner_id", "updated_at", "date", "description") VALUES('2010-04-14 20:48:30', 5, '2010-04-14 20:48:30', '2010-01-01', 'Alsterlauf')